---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.HandClearance
source: html/f996c210-b168-607e-61c0-130eb3121d91.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.HandClearance Property

The horizontal distance between the inner boundary of the rail and the path.

## Syntax (C#)
```csharp
public double HandClearance { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for clearance must be no more than 30000 feet in absolute value.